      * Sample COBOL program
       IDENTIFICATION DIVISION.
       PROGRAM-ID. blinky.

       PROCEDURE DIVISION.
       
       DISPLAY "Hello, world!".
       
      * todo: write a C file that writes to blinky (for now) and call that

       GOBACK.
       END PROGRAM blinky.
       